[{"Benefit": "Reduce your disease risk", "Description": "Broccoli rabe offers a powerful dose of fiber, vitamins and minerals including antioxidants and phytochemicals which have been shown to lower cholesterol, prevent heart disease and may help reduce the risk of cancer. Experts believe that the carotenoids in broccoli rabe act as antioxidants, slowing the damage that free radicals cause our bodies, before they can do harm."}, {"Benefit": "Pump up the vitamin volume", "Description": "1 cup of broccoli rabe has more than 112% of your daily recommendation of vitamin K (strong bones!) and about 20% your recommendation of vitamin A (20/20 vision anyone?)."}, {"Benefit": "Fill up til you’re full", "Description": "Broccoli rabe has a high water volume, which helps you stay hydrated. One study showed subjects’ metabolic rate increased 30 percent within 10 minutes after drinking 17 ounces of water. Broccoli rabe also have a high fiber content, which not only leaves you feeling satisfied and full for longer, but also helps keep things moving in the GI tract."}, {"Benefit": "Amp your weight loss", "Description": "All veggies offer multiple nutrients for very few calories, aiding in weight loss efforts. When it comes to broccoli rabe, the more the merrier!"}, {"Benefit": "Boost your brain", "Description": "One study found that women who ate the most leafy greens, like broccoli rabe, and cruciferous vegetables had brains that were 1 to 2 years “younger” in performance than those who ate fewer. Bringin’ back the youth"}, {"Benefit": "Promote skin health", "Description": "The phytochemicals and antioxidants found in green veggies like broccoli rabe can help protect your skin against UV damage by countering free radicals in your body to lessen the deterioration of skin’s vital components like collagen and elastin. Say hello to greens and say hello to gorgeous skin!"}, {"Benefit": "Calcium without the dairy", "Description": "Calcium is an absolutely vital nutrient for keeping your bones healthy and strong. Whether dairy isn’t an option for you, or if you’re just looking for some variety, broccoli rabe will give you a tasty calcium boost that you need."}, {"Benefit": "Protect your eye health", "Description": "Carrots tend to get most of the credit when talking about eye health, but broccoli rabe and other leafy greens contain lutein, which help block certain light rays from damaging your eyes"}]