[{"Benefit": "Raw Milk Is Packed With Nutrients", "Description": "The nutritional profile of Organic Pastures Dairy raw milk is impressive. After all, it’s designed to fully nourish a newborn. \n\nJust one cup (244 grams) of whole cow’s raw milk contains:\n\nCalories: 150\n\nProtein: 8 grams\n\nFat: 8 grams\n\nCalcium: 30% of the RDA\n\nVitamin A: 6% of the RDA\n\nIron: 6% of the RDA\n\nCholesterol: 10% of the RDA\n\nSugars: 12 grams\n\nRaw milk is an excellent source of easy to digest (bioavailable) vitamins and minerals, including “nutrients  of concern,” which are under-consumed by many populations.\n\nRaw milk is also a good source of vitamin A, magnesium, zinc and thiamine (B1).\n\nAdditionally,  it’s an excellent source of protein and contains hundreds of different healthy fatty acids, including conjugated linoleic acid (CLA) and omega-3s.\n\nConjugated linoleic acid and omega-3 fatty acids are linked to many health benefits.\n\nThe nutritional content of raw milk varies, depending on factors like its fat content and the diet and treatment of the cow it came from. At Organic Pastures, our cows mob graze 365 days a year on lush, irrigated pastures. This leads to a naturally high level of CLA (conjugated linoleic acid) and omega-3 fatty acids. Raw milk from cows that eat mostly grass contains significantly higher amounts of conjugated linoleic acid and omega-3 fatty acids (11).\n\nAlso,  organic and grass-fed cow’s raw milk contains higher amounts of beneficial antioxidants, such as vitamin E and beta-carotene, which help reduce  inflammation and fight oxidative stress (12)."}, {"Benefit": "It's A Good Source of Quality RAW Protein", "Description": "Raw milk is a rich source of raw protein, with just one cup containing 8 grams. \n\nProtein  is necessary for many vital functions in your body, including growth and development, cellular repair and immune system regulation (13).\n\nRaw milk  is considered a “complete protein,” meaning it contains all nine of the  essential amino acids necessary for your body to function at an optimal  level (14). \n\nThere are two main types of protein found in raw milk — casein and whey protein. Both are considered high-quality proteins.\n\nCasein makes up the majority of the protein found in cow’s raw milk, comprising  70–80% of the total protein content. Raw whey accounts for around 20% (15).\n\nRaw Whey protein contains the branched-chain amino acids leucine, isoleucine and valine, all of which are linked to health benefits.\n\nBranched-chain amino acids may be particularly helpful in building muscle, preventing  muscle loss and providing fuel during exercise (16, 17).\n\nDrinking Organic Pastures Dairy raw milk  is associated with a lower risk of age-related muscle loss.\n\nIn fact, higher consumption of Organic Pastures Dairy raw milk and Organic Pastures Dairy raw milk cheese products has been linked to greater whole-body muscle mass and better physical performance in older  adults (18). \n\nRaw milk has also been shown to boost muscle repair in athletes. \n\nIn fact, several studies have demonstrated that drinking raw milk after a  workout can decrease muscle damage, promote muscle repair, increase strength and even decrease muscle soreness (19, 20, 21). "}, {"Benefit": "Raw Milk Benefits Bone Health", "Description": "Drinking milk has long been associated with healthy bones.\n\nThis  is due to its powerful combination of nutrients, including calcium,  phosphorus, potassium, protein and (in grass-fed, full-fat dairy)  vitamin K2.\n\nAll of these nutrients are essential for maintaining strong, healthy bones.\n\nApproximately 99% of your body’s calcium is stored in your bones and teeth (22).\n\nMilk  is an excellent source of the nutrients your body relies on to properly  absorb calcium, including vitamin D, vitamin K, phosphorus and  magnesium. \n\nAdding milk and dairy products to your diet may prevent bone diseases like osteoporosis.\n\nStudies have linked milk and dairy to a lower risk of osteoporosis and fractures, especially in older adults (23, 24, 25). \n\nWhat’s more, milk is a good source of protein, a key nutrient for bone health.\n\nIn fact, protein makes up about 50% of bone volume and around one-third of bone mass (26).\n\nEvidence  suggests that eating more protein may protect against bone loss,  especially in women who do not consume enough dietary calcium (27)."}, {"Benefit": " Helps Prevent Weight Gain", "Description": "Several studies have linked raw milk intake to a lower risk of obesity. \n\nInterestingly, this benefit has only been associated with whole raw milk.\n\nA  study in 145 three-year-old Latino children found that higher milk-fat consumption was associated with a lower risk of childhood obesity (28).\n\nAnother  study including over 18,000 middle-aged and elderly women showed that eating more high-fat dairy products was associated with less weight gain  and a lower risk of obesity (29).\n\nRaw milk contains a variety of components that may contribute to weight loss and prevent weight gain. \n\nFor example, its high-protein content helps you feel full for a longer period of time, which may prevent overeating (30, 31).\n\nFurthermore, the CLA (conjugated linoleic) acid in raw milk has been studied for its ability to boost weight loss by promoting fat breakdown and inhibiting fat production (32).\n\nAdditionally, many studies have associated diets rich in calcium with a lower risk of obesity.\n\nEvidence suggests that people with a higher intake of dietary calcium have a lower risk of being overweight or obese. \n\nStudies have shown that high levels of dietary calcium promote fat breakdown and inhibit fat absorption in the body (33, 34). "}, {"Benefit": "Raw Milk Is a Versatile Ingredient", "Description": "Raw milk is a nutritious beverage that provides a number of health benefits. Moreover, it’s a versatile ingredient that can be easily added to your diet.\n\nAside from drinking raw milk, try these ideas for incorporating it into your daily routine: Raw Smoothies:  It makes an excellent, high-protein base for healthy smoothies. Using Organic Pastures Dairy Whole Raw Kefir can add additional raw probiotics for better digestion. Try  combining it with greens and a small amount of fruit for a nutritious  snack.\n\nOatmeal: It provides a tasty, more nutritious alternative to water when making your morning oatmeal or hot cereal. Adding Organic Pastures Raw Butter is an easy way to add essential healthy fats into your daily diet. \n\nCoffee: Adding it to your morning coffee or tea will give your beverage a boost of beneficial nutrients. Raw recipes can be found here: https://www.youtube.com/organicpastures\n\nSoups: Try adding it to your favorite soup recipe for added flavor and nutrition. Pouring in Organic Pastures Heavy Raw Cream is a wonderful and quick way to make any soup nutrient dense and extra creamery!"}]