[{"Recipe": "Guacamole (Avocado Dip) Recip", "Ingredients": "2 medium or 1 large Ripe Avocado\n3 tablespoons finely chopped Red Onion\n1/4 cup finely chopped Cilantro (coriander leaves)\n1/2 Jalapeño Pepper, seeded and chopped (or any green chilli)\n2 teaspoons Lime Juice\n1/4 teaspoon Salt (or to taste)", "Instructions": "step-1\nChoose ripe avocados. To check whether the avocado is ripe or not, remove the stem and check if the underneath of stem is green or dark brown. If it’s bright green then avocado is ready. If it’s dark brown then it is overripe. If the stem doesn’t come off easily then avocado is not ripe yet. You can also check for ripeness by pressing the avocado gently – if it feels little soft yet firm then it is ready, if it feels mushy or very soft then it is over-ripe, if it feels firm it is under ripe.\nstep-2\nCut them into halves as shown in the picture and remove the pit/stone carefully. Do not try to cut through pit as it’s very hard. Instead cut around it from all sides and twist both parts – one part will come off easily and pit would remain in other part. Remove pit by slightly inserting knife’s sharp edge in it and twisting a bit.\nstep-3\nScoop out the avocado flesh and place in a medium size bowl. Add finely chopped onion, chopped cilantro, chopped Jalapeño, lemon juice and salt.\nstep-4\nMash them with a fork (use potato masher if you are making it in large quantity). Keep little chunky texture. Taste for the seasonings and add more if required. Guacamole is ready. Serve it immediately or store it in an airtight container in refrigerator. To prevent it from discoloring, keep the removed avocado pit/stone with prepared Guacamole in the container.\n"}, {"Recipe": "Healthy 5 Minute Avocado Toast", "Ingredients": "1 avocado peeled and seeded\n2 tablespoons chopped cilantro\njuice of 1/2 lime\n1/2 teaspoon red pepper flakes optional\nsalt & pepper to taste\n2 slices whole grain bread or bread of choice\n2 eggs fried, scrambled, or poached, optional", "Instructions": "Toast 2 slices of whole grain in a toaster until golden and crispy.\nIn a small bowl combine and mash the avocado, cilantro, lime, and salt + pepper to taste. Spread half of the mixture on each slice of toasted bread. Top with fried, scrambled, or poached egg if desired."}, {"Recipe": "Fresh Herbed Avocado Salad", "Ingredients": "½ cup raw pepitas (green pumpkin seeds)\n¼ teaspoon chili powder\n¼ teaspoon extra-virgin olive oil\nPinch of salt\n½ cup chopped radish (about 3 medium)\n½ cup chopped green onion\n½ cup chopped fresh cilantro, parsley, basil, dill or any combination thereof\n1 medium jalapeño, seeds and membranes removed, chopped (omit if sensitive to spice)", "Instructions": "Since avocados start browning once they’re cut, we’re going to prepare everything else first. Toast the pepitas in a large skillet over medium heat, stirring often (don’t let them burn!), until they’re starting to turn golden on the edges and make little popping noises, about 3 to 5 minutes. Remove the skillet from the heat and stir in the chili powder, olive oil and pinch of salt. Set aside to cool.\nMeanwhile, combine the chopped radish, green onion, herbs and jalapeño in a bowl, and set aside.\nTo prepare the dressing, whisk together the lime juice, olive oil, honey and salt in a small bowl. Set aside.\nYou can slice or dice the avocados however you’d like, but for the prettiest slices (like mine), first cut the avocados in half and remove the pits. Then cut the halves in half again to make long quarters. Peel the avocado skin off each quarter and carefully slice it into long strips.\nTo assemble, place the avocado in a medium serving bowl or platter. Drizzle the dressing all over them. Stir the toasted pepitas into the herb mix, then spoon it over the avocados. Finish the salad with optional flaky salt and/or lime zest."}]